<?php

declare(strict_types=1);

return [
    /*
     * ---------------------------------------------------------------
     * 是否打开 JSON 调试
     * ---------------------------------------------------------------
     *
     * 返回接口中显示系统注入的调试信息
     */
    'json' => Leevel::env('DEBUG_JSON', true),

    /*
     * ---------------------------------------------------------------
     * 是否打开 Console 调试
     * ---------------------------------------------------------------
     *
     * 浏览器控制台中显示系统注入的调试信息
     */
    'console' => Leevel::env('DEBUG_CONSOLE', true),
];
