<?php

declare(strict_types=1);

return [
    /*
     * ---------------------------------------------------------------
     * 运行环境
     * ---------------------------------------------------------------
     *
     * 根据不同的阶段设置不同的开发环境
     * 可以为 production : 生产环境 testing : 测试环境 development : 开发环境
     */
    'environment' => Leevel::env('ENVIRONMENT', 'development'),

    /*
     * ---------------------------------------------------------------
     * 是否打开调试模式
     * ---------------------------------------------------------------
     *
     * 打开调试模式可以显示更多精确的错误信息
     */
    'debug' => Leevel::env('DEBUG', false),

    /*
     * ---------------------------------------------------------------
     * Gzip 压缩
     * ---------------------------------------------------------------
     *
     * 启用页面 gzip 压缩，需要系统支持 gz_handler 函数
     */
    'start_gzip' => true,

    /*
     * ---------------------------------------------------------------
     * 系统时区
     * ---------------------------------------------------------------
     *
     * 此配置用于 date_default_timezone_set 应用设置系统时区
     * 此功能会影响到 date.time 相关功能
     */
    'time_zone' => 'Asia/Shanghai',

    /*
     * ---------------------------------------------------------------
     * 安全 key
     * ---------------------------------------------------------------
     *
     * 请妥善保管此安全 key,防止密码被人破解
     * \Leevel\Encryption\Encryption 安全 key
     */
    'auth_key' => Leevel::env('AUTH_KEY'),

    /*
     * ---------------------------------------------------------------
     * 安全 cipher
     * ---------------------------------------------------------------
     *
     * 加密算法支持的方法
     */
    'auth_cipher' => 'AES-256-CBC',

    /*
     * ---------------------------------------------------------------
     * 安全 RSA 私钥
     * ---------------------------------------------------------------
     *
     * 加密数据附加的生成签名
     */
    'auth_rsa_private' => file_get_contents(Leevel::path('assets/rsa/rsa_private_key.pem')),

    /*
     * ---------------------------------------------------------------
     * 安全 RSA 公钥
     * ---------------------------------------------------------------
     *
     * 解密数据附加的校验签名
     */
    'auth_rsa_public' => file_get_contents(Leevel::path('assets/rsa/rsa_public_key.pem')),

    /*
     * ---------------------------------------------------------------
     * 默认是否带上伪静态后缀
     * ---------------------------------------------------------------
     *
     * 主要用于 url 生成
     */
    'with_suffix' => false,

    /*
     * ---------------------------------------------------------------
     * 伪静态后缀
     * ---------------------------------------------------------------
     *
     * 系统进行路由解析时将会去掉后缀后然后继续执行 url 解析
     */
    'suffix' => '.html',

    /*
     * ---------------------------------------------------------------
     * 顶级域名
     * ---------------------------------------------------------------
     *
     * 例如 queryphp.com，用于路由解析以及 \Leevel\Router\Url::make 生成
     */
    'domain' => Leevel::env('DOMAIN', ''),

    /*
     * ---------------------------------------------------------------
     * 静态资源地址
     * ---------------------------------------------------------------
     *
     * 设置静态资源 URL 地址
     * php leevel link:static
     */
    'static_url' => Leevel::env('STATIC_URL', 'http://127.0.0.1:9527/static'),

    /*
     * ---------------------------------------------------------------
     * 附件地址
     * ---------------------------------------------------------------
     *
     * 设置上传附件 URL 地址
     * php leevel link:attachments
     */
    'attachments_url' => Leevel::env('ATTACHMENTS_URL', 'http://127.0.0.1:9527/attachments'),
];
