<?php

declare(strict_types=1);

namespace App\Infra\Exceptions;

use Leevel\Support\Enum;
use Leevel\Support\Msg;

/**
 * 通用业务错误码.
 *
 * - 应用标识(服务): 表示错误属于哪个应用，第一个数字从 1 开始，三位数字(100)
 * - 功能域标识(模块): 表示错误属于应用中的哪个功能模块，三位数字(000)
 *   100000 表示通用业务错误码
 *   100001 表示用户业务错误码
 *   100002 表示上传业务错误码
 *   100003 表示认证业务错误码
 *   100004 表示配置业务错误码
 *   100005 表示项目业务错误码
 *   20230305144449531 为了减少开发成本，可以基于当前微秒时间的错误码
 * - 错误类型: 表示错误属于那种类型，一位数字(0)
 *   0 表示错误来源于用户，参数错误，用户安装版本过低，用户支付超时等问题;
 *   1 表示错误来源于当前系统，往往是业务逻辑出错，或程序健壮性差等问题;
 *   2 表示错误来源于第三方服务，比如 CDN 服务出错，消息投递超时等问题;
 *   3 表示错误来源于数据库，数据库无法连接等;
 *   4 表示错误来源于缓存 Redis 等，缓存中间件无法连接等;
 * - 错误编码: 错误类型下的具体错误，三位数字(000)
 *
 * @see https://zhuanlan.zhihu.com/p/152115647
 */
enum ErrorCode: int
{
    use Enum;

    #[Msg('删除数据参数错误')]
    case DESTROY_DATA_INVALID_ARGUMENT = 1000000000;

    #[Msg('批量修改状态参数错误')]
    case BATCH_MODIFICATION_STATUS_INVALID_ARGUMENT = 1000000001;

    #[Msg('未发现数据')]
    case BATCH_MODIFICATION_STATUS_NO_DATA_FOUND = 1000000002;

    #[Msg('应用无法找到')]
    case APP_NOT_FOUND = 1000000003;

    #[Msg('参数错误')]
    case BASE_INVALID_ARGUMENT = 1000000005;

    #[Msg('导入验证错误')]
    case ID2023030514491238 = 2023030514491238;

    #[Msg('导入的字段全部不允许')]
    case ID2023032511343739 = 2023032511343739;

    #[Msg('字段取值错误')]
    case ID2023032511361029 = 2023032511361029;

    #[Msg('导入的数据不能为空')]
    case ID2023032511385341 = 2023032511385341;

    #[Msg('导入的数据异常')]
    case ID2023032511385418 = 2023032511385418;

    #[Msg('数据更新失败')]
    case ID2023033020572500 = 2023033020572500;

    #[Msg('数据变更数量必须大于0')]
    case ID2023033017412773 = 2023033017412773;

    #[Msg('数据变更数量必须大于等于0')]
    case ID2023033017452060 = 2023033017452060;

    #[Msg('API接口不能为空')]
    case API_QL_BATCH_APIS_EMPTY = 2023040922164854;

    #[Msg('API接口参数不能为空')]
    case API_QL_BATCH_PARAMS_EMPTY = 2023040922191224;

    #[Msg('API接口无效')]
    case API_QL_BATCH_APIS_INVALID = 2023040922312856;

    #[Msg('API接口参数无效')]
    case API_QL_BATCH_PARAMS_INVALID = 2023040922333084;

    #[Msg('API接口和参数数量不一致')]
    case ID2023040922413601 = 2023040922413601;

    #[Msg('API批量查询语言返回数据必须为数组')]
    case ID2023051617254261 = 2023051617254261;

    #[Msg('数据唯一值重复')]
    case ID2023052616455333 = 2023052616455333;

    #[Msg('数据创建验证失败')]
    case ID2023052723282439 = 2023052723282439;

    #[Msg('数据更新验证失败')]
    case ID2023052723275780 = 2023052723275780;
}
